app/Http/Livewire/Admin/Dashboard/PersonalSection.php

insert into `appointment_dates` (`date`, `updated_at`, `created_at`) values ('2022-03-24', '2022-03-10 04:59:15', '2022-03-10 04:59:15')
---
    public function makeAppointmentSchedule()
    {
        $this->showConfirmModal = false;
        //store date with the day currentMonth and currentYear as Carbon date format with as yyyy-mm-dd
        $date = Carbon::create($this->currentYear, $this->currentMonthNumeric, $this->day_to_store)->format('Y-m-d');
        //store to database the date on appointmentdate table
        $appDate = AppointmentDate::create([
            'date' => $date
        ]);