app/Http/Livewire/Admin/Dashboard/PersonalSection.php

    public function render()
    {


            $this->currentMonth = Carbon::now()->addMonths($this->monthadditive)->format('F');

            $this->currentMonthNumeric = Carbon::now()->addMonths($this->monthadditive)->format('m');

            $this->currentYear = Carbon::now()->addMonths($this->monthadditive)->format('Y');

            $this->startDay = Carbon::now()->addMonths($this->monthadditive)->startOfMonth()->format('l');

        $this->appointmentdates = AppointmentDate::where('date','like',$this->currentYear.'-'.$this->currentMonthNumeric.'%')->get();
---
select * from `appointment_dates` where `date` like '2022-01%'

        }
        //get the appointments for the current month

        return view('livewire.admin.dashboard.personal-section')->with('vaccines',Vaccine::all());
---
select * from `vaccines`

    public function makeAppointmentSchedule()
    {


        //store date with the day currentMonth and currentYear as Carbon date format with as yyyy-mm-dd
        $date = Carbon::create($this->currentYear, $this->currentMonthNumeric, $this->day_to_store)->format('Y-m-d');
        //store to database the date on appointmentdate table
        $appDate = AppointmentDate::create([
            'date' => $date,
            'vaccine_id' => $this->vaccineid
        ]);
        $appTime ="";
        $timeStart = 7;
        $timeEnd = 8;
        for ($i = 0; $i <= 8; $i++) {
            //store to database the time on appointmenttime table

            $timeStart++;
            $timeEnd++;

            if($timeStart != 12){
                if($timeEnd == 12){

                $appTime = AppointmentTime::create([
                    'appointment_date_id' => $appDate->id,
                    'time_slot' => $timeStart.':00 AM - '.$timeEnd.':00 PM',
                ]);
                }else{
                   if($timeStart < 8){
                    $appTime = AppointmentTime::create([
                        'appointment_date_id' => $appDate->id,
                        'time_slot' => $timeStart.':00 PM - '.$timeEnd.':00 PM',
                    ]);
                   }else{
                    $appTime = AppointmentTime::create([
                        'appointment_date_id' => $appDate->id,
                        'time_slot' => $timeStart.':00 AM - '.$timeEnd.':00 AM',
                    ]);
---
insert into `appointment_dates` (`date`, `vaccine_id`, `updated_at`, `created_at`) values ('2022-03-08', '3', '2022-03-10 07:08:02', '2022-03-10 07:08:02')
insert into `appointment_times` (`appointment_date_id`, `time_slot`, `updated_at`, `created_at`) values (2, '11:00 AM - 12:00 PM', '2022-03-10 04:59:15', '2022-03-10 04:59:15')
insert into `appointment_times` (`appointment_date_id`, `time_slot`, `updated_at`, `created_at`) values (1, '11:00 AM - 12:00 PM', '2022-03-10 07:08:02', '2022-03-10 07:08:02')
insert into `appointment_times` (`appointment_date_id`, `time_slot`, `updated_at`, `created_at`) values (1, '1:00 PM - 2:00 PM', '2022-03-10 07:08:02', '2022-03-10 07:08:02')

    public function getSlots($adp_id){
        if ($adp_id != "0") {
            $appointmentdate = AppointmentDate::find($adp_id);
---
select * from `appointment_dates` where `appointment_dates`.`id` = 2 limit 1