app/Http/Livewire/Admin/Dashboard/Timeslots.php

    public function render()
    {

        //convert $aDid to integer
        $this->aDid = intval($this->aDid);
        $temp = AppointmentDate::where('id',$this->aDid)->get('date');
---
select * from `appointment_dates` where `appointment_dates`.`id` = '3' limit 1