app/Http/Livewire/Admin/Dashboard/Timeslots.php

    public function render()
    {
        //convert $aDid to integer
        $this->aDid = intval($this->aDid);
        //if tsID is not set, then set it to the first id from AppointmentTime table where appointment_id = aDid
        if(!isset($this->tsID)){
            $this->tsID = AppointmentTime::where('appointment_date_id', $this->aDid)->first()->id;
        }
        $pIDs=[];
        $appointments=[];
        if($this->searchterm != ""){
            $pa= PatientInformation::orWhere('first_name','like',"%".$this->searchterm."%")->orWhere('middle_name','like',"%".$this->searchterm."%")->orWhere('last_name','like',"%".$this->searchterm."%")->get('id');
            foreach ($pa as $key => $value) {
                $pIDs[] = $value->id;
            }
            array_values($pIDs);
            $appointments = Appointment::where('appointment_date_id',$this->aDid)->where('appointment_time_id',$this->tsID)->whereIn('patient_id',$pIDs)->get();
        }else{
            $appointments = Appointment::where('appointment_date_id',$this->aDid)->where('appointment_time_id',$this->tsID)->get();
        }

        return view('livewire.admin.dashboard.timeslots',['vaccine_name'=>AppointmentDate::find($this->aDid)->vaccine->vaccine_name,'tslots'=>AppointmentTime::where('appointment_date_id',$this->aDid)->get(),
        'appointments'=>$appointments]);
---
select * from `appointment_times` where `appointment_date_id` = 3 limit 1
select `id` from `patient_information` where `first_name` like '%asc%' or `middle_name` like '%asc%' or `last_name` like '%asc%'
select * from `appointments` where `appointment_date_id` like 3 and `appointment_time_id` like 24 and `patient_id` in (1)
select * from `appointments` where `appointment_date_id` = 3 and `appointment_time_id` = 17
select * from `appointment_times` where `appointment_date_id` = 3

    public function getAppointments($id)
    {
        $this->tsID = $id;
        $at = AppointmentTime::findOrFail($id);
---
select * from `appointment_times` where `appointment_times`.`id` = 28 limit 1