app/Http/Livewire/Client/Dashboard/ClientPersonalSection.php

    public function render()
    {


        $patient = PatientInformation::where('user_id', '=',auth()->user()->id)->first();
---
select * from `patient_information` where `user_id` = 2 limit 1